app/views/modules/show.html.erb

SELECT "users".* FROM "users" ORDER BY "users"."updated_at" DESC
---
    </section>
  <% elsif @slug == "user-hierarchy-list" && @record.blank? %>

SELECT "users".* FROM "users" WHERE "users"."user_name" = $1 LIMIT $2  [["user_name", "other_target_admin"], ["LIMIT", 1]]
---
            <% form_required = (@slug == "training-form" && !optional_training_fields.include?(field)) || other_target_form || add_farmer_form %>
            <% required_attr = (form_required || (@slug == "jeevika-jankar-transfer" && ["FCOC", "User Name", "Jeevika Jankar Names"].include?(field))) ? "required" : nil %>