app/controllers/api/v1/jeevika_jankars_controller.rb

INSERT INTO "vrps" ("aadhar_no", "account_no", "address", "agreement_accepted_at", "agreement_signature_data", "bank_name", "branch", "cluster_incharge", "created_at", "created_by_id", "created_by_type", "date_of_birth", "date_of_joining", "email", "emergency_no", "experience_in_years", "father_husband_name", "fcoc", "gender", "gram_panchayat_ids", "ics_master_ids", "ifsc_code", "is_active", "is_deleted", "mobile_no", "name", "office_detail_id", "password", "person_type", "project_master_ids", "role", "stakeholder", "stakeholder_role", "status", "to_name", "to_office_detail_id", "updated_at", "user_id", "user_management_role", "user_name", "village_ids", "vrp_bank_master_id", "vrp_type_ids") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32, $33, $34, $35, $36, $37, $38, $39, $40, $41, $42, $43) RETURNING "id"
---
      def create
        merge_json_body_params!
        attrs = jeevika_jankar_attributes

        vrp = Vrp.new(attrs)
        vrp.created_by_id = current_app_user_id if vrp.respond_to?(:created_by_id=)

UPDATE "vrps" SET "address" = $1, "name" = $2, "updated_at" = $3 WHERE "vrps"."id" = $4  [["address", "Updated Address"], ["name", "Updated JJ Name"], ["updated_at", "2026-09-15 06:46:36.877797"], ["id", 27]]
---
      def update
        merge_json_body_params!
        vrp = find_api_manageable_vrp(params[:id])
        unless vrp
          return render json: { success: false, message: "Jeevika Jankar record not found or you cannot edit it." }, status: :not_found
        end

        attrs = jeevika_jankar_attributes(for_update: true)
        unless update_password_confirmed?(attrs)
          return render json: {
            success: false,
            message: "Password and Confirm Password must match.",
            errors: [ "Password and Confirm Password must match" ]
          }, status: :unprocessable_entity
        end

        vrp.assign_attributes(attrs)
        if vrp.save

SELECT "vrps".* FROM "vrps" WHERE "vrps"."is_deleted" = $1 AND "vrps"."id" = $2 LIMIT $3  [["is_deleted", false], ["id", 25], ["LIMIT", 1]]
---
      def find_api_manageable_vrp(id)
        if current_app_user&.dig("record_type") == "Vrp"
          return Vrp.find_by(id: id, is_deleted: false) if current_app_user_id.to_i == id.to_i