app/controllers/api/v1/jeevika_jankar_dashboard_controller.rb

      def show
        return render_admin_dashboard if admin_dashboard_request?

        vrp = current_dashboard_vrp
        return render json: { success: false, message: "Valid Jeevika Jankar login required." }, status: :unprocessable_entity unless vrp

        targets = TargetMapping.includes(:vrp).where(vrp_id: vrp.id).order(:month_name, :main_activity_name, :activity_name, :id).to_a
        months = targets.filter_map { |target| target.month_name.to_s.strip.presence }.uniq
        selected_month = params[:month].presence || params[:training_month].presence || default_month(months)
        targets = targets.select { |target| same_text?(target.month_name, selected_month) } if selected_month.present?
---
SELECT "target_mappings".* FROM "target_mappings" ORDER BY "target_mappings"."updated_at" DESC