app/controllers/api/v1/jeevika_jankar_masters_controller.rb

      def create_type
        merge_json_body_params!
        name = params[:jeevika_jankar_type_name].presence || params[:name].presence
        if name.blank?
          return render json: {
            success: false,
            message: "Jeevika Jankar Type Name is required.",
            errors: [ "Jeevika Jankar Type Name can't be blank" ]
          }, status: :unprocessable_entity
        end

        duplicate = ModuleRecord.where(module_slug: "add-vrp-type").find do |record|
          record.data["jeevika_jankar_type_name"].to_s.casecmp(name.to_s.strip).zero?
        end
        if duplicate
          return render json: {
            success: false,
            message: "Jeevika Jankar Type already exists.",
            errors: [ "Jeevika Jankar Type Name has already been taken" ]
          }, status: :unprocessable_entity
        end

        record = ModuleRecord.new(
          module_slug: "add-vrp-type",
          data: {
            "jeevika_jankar_type_name" => name.to_s.strip,
            "status" => normalized_status(params[:status])
          }
        )
        record.created_by_id = current_api_user.id if record.respond_to?(:created_by_id=)
---
SELECT "module_records".* FROM "module_records" WHERE "module_records"."module_slug" = $1  [["module_slug", "add-vrp-type"]]
INSERT INTO "module_records" ("created_at", "data", "module_slug", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"