app/controllers/sessions_controller.rb

UPDATE "vrps" SET "agreement_accepted_at" = $1, "agreement_signature_data" = $2, "updated_at" = $3 WHERE "vrps"."id" = $4  [["agreement_accepted_at", "2026-07-09 04:27:16.410672"], ["agreement_signature_data", "data:image/png;base64,signature"], ["updated_at", "2026-07-09 04:27:16.422505"], ["id", 2]]
---
  def complete_agreement
    @vrp = pending_vrp_agreement

    unless @vrp
      redirect_to login_path, alert: "Please login again to continue."
      return
    end

    if params[:decision] == "agree"
      signature_data = params[:signature_data].to_s.strip
      if signature_data.blank?
        @agreement_details = agreement_details(@vrp)
        flash.now[:alert] = "Please sign before accepting the declaration."
        render :agreement, status: :unprocessable_entity
        return
      end

      @vrp.update!(agreement_accepted_at: Time.current, agreement_signature_data: signature_data)

SELECT "users".* FROM "users" WHERE "users"."user_name" = $1 LIMIT $2  [["user_name", ""], ["LIMIT", 1]]
SELECT "vrps".* FROM "vrps" WHERE "vrps"."is_deleted" = $1 AND "vrps"."is_active" = $2 AND "vrps"."is_deleted" = $3 AND "vrps"."id" = $4 LIMIT $5  [["is_deleted", false], ["is_active", true], ["is_deleted", false], ["id", 3], ["LIMIT", 1]]
---
  def find_password_reset_account(username)
    return if username.blank?
    username_key = username.to_s.strip.downcase

    if "User".safe_constantize&.table_exists?
      user = User.where.not(status: "Inactive")
        .where("LOWER(user_name) = ?", username_key)
        .first
      return user if user
    end

    if "Vrp".safe_constantize&.table_exists? && Vrp.column_names.include?("user_name")
      vrp = Vrp.where(is_active: true, is_deleted: false)
        .where("LOWER(user_name) = ?", username_key)
        .first

SELECT "module_records".* FROM "module_records" WHERE "module_records"."module_slug" = $1 AND (LOWER(data::jsonb ->> 'user_name') = $2 OR LOWER(data::jsonb ->> 'email') = $3 OR data::jsonb ->> 'mobile_no' = $4) AND (COALESCE(LOWER(data::jsonb ->> 'status'), 'active') <> 'inactive') AND (data::jsonb ->> 'password' = $5) LIMIT $6  [["module_slug", "new-user"], [nil, "wrong_password_vrp"], [nil, "wrong_password_vrp"], [nil, "wrong_password_vrp"], [nil, "bad-secret"], ["LIMIT", 1]]
---
  def find_legacy_password_reset_account(username_key)
    ModuleRecord.where(module_slug: "new-user").find_each do |record|