app/controllers/target_mappings_controller.rb

  def index
    @vrp_target_view = non_admin_vrp_login?
    @admin_mapping_actions = admin_login?
    @remove_mapping_actions = !admin_login? && !non_admin_vrp_login?
    @vrps = target_vrps
    @month_options = module_options("month-master", "month_name")
    @main_activity_options = module_options("add-activity-group", "main_activity_name", "activity_group_name")
    @main_activity_type_map = main_activity_type_map
    @target_sub_activity_map = target_sub_activity_map
    @block_fco_options = filtered_office_fco_options
    @block_options_by_fco = @block_fco_options.to_h do |option|
      fco_id, = parse_location_value(option[:value])
      [fco_id, office_block_options(option[:value])]
    end
    @target_mappings = dashboard_filtered_target_mappings(visible_target_mappings)
      .includes(:vrp, :vrp_ics_mapping).order(updated_at: :desc)
    # The table is deliberately rendered from row hashes (it also supports
    # summary rows).  Build the normal record rows here; previously this was
    # never assigned, so a successfully saved mapping always looked empty.
    @target_mapping_rows = target_mapping_rows(@target_mappings)
    @target_farmers_by_id = {}
    @edit_target = visible_target_mappings.find_by(id: params[:edit_id]) if params[:edit_id].present? && @admin_mapping_actions
---
SELECT "vrp_ics_mappings".* FROM "vrp_ics_mappings" WHERE "vrp_ics_mappings"."id" = $1  [["id", 1]]

  def create
    if (opg_error = training_target_opg_error)
      redirect_to target_mappings_path, alert: opg_error
      return
    end
    if (plan_error = weekly_plan_error)
      redirect_to target_mappings_path, alert: plan_error
      return
    end

    if editable_target
      target_mapping = editable_target
      target_mapping.assign_attributes(single_target_mapping_attributes)
      apply_weekly_plan_target(target_mapping)
      target_mapping.vrp_ics_mapping_id = nil
      normalize_location_values(target_mapping)
      assign_afl_location_names(target_mapping)

      if target_vrp_allowed?(target_mapping) && assign_target_farmers(target_mapping) && target_mapping.save
---
INSERT INTO "target_mappings" ("activity_name", "afl_ids", "created_at", "created_by_id", "created_by_type", "farmer_count", "fco_id", "fco_name", "ics_id", "ics_name", "main_activity_name", "month_name", "target_quantity", "updated_at", "village_id", "village_name", "vrp_ics_mapping_id", "vrp_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18) RETURNING "id"