app/controllers/vrp_agreements_controller.rb

UPDATE "vrps" SET "agreement_accepted_at" = $1, "agreement_signature_data" = $2, "updated_at" = $3 WHERE "vrps"."id" = $4  [["agreement_accepted_at", nil], ["agreement_signature_data", nil], ["updated_at", "2026-07-09 06:07:01.128649"], ["id", 24]]
---
  def destroy
    @vrp = Vrp.find_by(id: params[:id])
    unless @vrp
      redirect_to vrp_agreements_path, alert: "Agreement not found."
      return
    end

    @vrp.update!(agreement_accepted_at: nil, agreement_signature_data: nil)