app/controllers/vrps_controller.rb

UPDATE "vrps" SET "status" = $1, "updated_at" = $2 WHERE "vrps"."id" = $3  [["status", 25], ["updated_at", "2026-09-15 06:46:36.024565"], ["id", 19]]
---
  def set_active
    @vrp = find_manageable_vrp(params[:id])

    unless @vrp
      redirect_to vrps_path, alert: "Jeevika JankaR record not found."
      return
    end

    active = ActiveModel::Type::Boolean.new.cast(params[:active])
    @vrp.update_columns(is_active: active, updated_at: Time.current)